src/cf/DataProcessors/РаботаСРезультатамиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РаботаСРезультатамиОбмена</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/ДействияПриУстановкеСоответствийОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДействияПриУстановкеСоответствийОбъектам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УстановитьСоответствиеИЗагрузить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьНовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗагружать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДействиеНеОпределено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановитьСоответствиеНоНеЗагружать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/РаботаСРезультатамиОбмена/Forms/ИнформацияПриПримененииИзменений/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры(Отказ);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ДанныеВозврата());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ОбработатьПереданныеПараметры(Отказ)
	
	Если ПустаяСтрока(Параметры.ПолноеИмяОбъектаМетаданных)
		И  Параметры.Изменения = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'В форму не передана информация о типе объекта и выполняемых изменениях.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	КоличествоИзменения      = КоличествоИзменения(Параметры.Изменения);
	ШрифтЗаголовкаПояснения  = ШрифтыСтиля.ЗаголовокПредставленияТипаОбъектаШрифт;
	
	ТекстГлавное = СтрШаблон(НСтр("ru = 'Будут применены выбранные действия для %1 ""%2""'"),
	                         РаботаСРезультатамиОбмена.ЧислоПрописьюПоТипуМетаданного(КоличествоИзменения, Параметры.ПолноеИмяОбъектаМетаданных),
	                         Параметры.СинонимТипаМетаданных); 
	
	Элементы.ДекорацияРезультатыЗаголовок.Заголовок = Новый ФорматированнаяСтрока(ТекстГлавное, ШрифтЗаголовкаПояснения, ЦветаСтиля.ЦветРамки);
	
	ТекстИменаДействий = "";
	ТекстКоличествоДействий = "";
	ТребуетсяПереводСтроки = Ложь;
	
	Для Каждого КлючИЗначение Из Параметры.Изменения Цикл
		
		Если КлючИЗначение.Ключ <> Перечисления.ДействияПриУстановкеСоответствийОбъектам.ДействиеНеОпределено Тогда
			
			Если ТребуетсяПереводСтроки Тогда
				
				ТекстИменаДействий      = ТекстИменаДействий      + Символы.ПС;
				ТекстКоличествоДействий = ТекстКоличествоДействий + Символы.ПС;
				
			КонецЕсли;
			
			ТекстИменаДействий      = ТекстИменаДействий + Строка(КлючИЗначение.Ключ);
			ТекстКоличествоДействий = ТекстКоличествоДействий + СтрШаблон("- %1.", Строка(КлючИЗначение.Значение)); 
			
			ТребуетсяПереводСтроки = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ИтогиДействия.Заголовок           = Новый ФорматированнаяСтрока(ТекстИменаДействий, ШрифтЗаголовкаПояснения, ЦветаСтиля.ЦветРамки);
	Элементы.ИтогиДействияКоличество.Заголовок = ТекстКоличествоДействий;
	
	ОбъектовБезДействий = Параметры.Изменения.Получить(Перечисления.ДействияПриУстановкеСоответствийОбъектам.ДействиеНеОпределено);
	Если ОбъектовБезДействий <> Неопределено Тогда
		Элементы.ДекорацияДействиеНеОпределеноКоличество.Заголовок = СтрШаблон("%1.", Строка(ОбъектовБезДействий));
	Иначе
		Элементы.ГруппаДействиеНеОпределено.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция КоличествоИзменения(ДанныеИзменений)
	
	КоличествоИзменения = 0;
	
	Для Каждого КлючИЗначение Из ДанныеИзменений Цикл
		
		Если ЗначениеЗаполнено(КлючИЗначение.Ключ) 
			И КлючИЗначение.Ключ <> Перечисления.ДействияПриУстановкеСоответствийОбъектам.ДействиеНеОпределено Тогда
			
			КоличествоИзменения = КоличествоИзменения + КлючИЗначение.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат КоличествоИзменения;
	
КонецФункции

&НаКлиенте
Функция ДанныеВозврата()
	
	ДанныеВозврата = Новый Структура;
	
	ДанныеВозврата.Вставить("ПрименитьИзменения", Истина);
	ДанныеВозврата.Вставить("НеПоказыватьБольше", НеПоказыватьБольше);
	
	Возврат ДанныеВозврата;
	
КонецФункции

#КонецОбласти
